# Part 2: Database Creation

In [1]:
import pandas as pd
import sqlite3

In [2]:
data = pd.read_csv("resources/data.csv")

data.head()

,year,date,state,magnitude,injuries,fatalities,latitude,longitude
0,1950,1950-01-03,IL,3,3,0,39.10,-89.30
1,1950,1950-01-03,MO,3,3,0,38.77,-90.22
2,1950,1950-01-03,OH,1,1,0,40.88,-84.58
3,1950,1950-01-13,AR,3,1,1,34.40,-94.37
4,1950,1950-01-25,IL,2,0,0,41.17,-87.33

## Connect to database, load the data, verify the data

In [3]:
connection = sqlite3.connect("resources/database.db")
cursor = connection.cursor()

In [4]:
data.to_sql("tornadoes", connection, if_exists="replace", index=False)

67558

In [5]:
cursor.execute("SELECT * FROM tornadoes")
rows = cursor.fetchmany(5)

for row in rows:
    print(row)

(1950, '1950-01-03', 'IL', 3, 3, 0, 39.1, -89.3)
(1950, '1950-01-03', 'MO', 3, 3, 0, 38.77, -90.22)
(1950, '1950-01-03', 'OH', 1, 1, 0, 40.88, -84.58)
(1950, '1950-01-13', 'AR', 3, 1, 1, 34.4, -94.37)
(1950, '1950-01-25', 'IL', 2, 0, 0, 41.17, -87.33)

In [6]:
connection.close()